MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J94/mcu.h
// Register: RPOR20_21
#define RPOR20_21 RPOR20_21
extern volatile unsigned char           RPOR20_21           __at(0xE1C);
#ifndef _LIB_BUILD
asm("RPOR20_21 equ 0E1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO20R                 :4;
        unsigned RPO21R                 :4;
    };
    struct {
        unsigned RPO20R0                :1;
        unsigned RPO20R1                :1;
        unsigned RPO20R2                :1;
        unsigned RPO20R3                :1;
        unsigned RPO21R0                :1;
        unsigned RPO21R1                :1;
        unsigned RPO21R2                :1;
        unsigned RPO21R3                :1;
    };
} RPOR20_21bits_t;
extern volatile RPOR20_21bits_t RPOR20_21bits __at(0xE1C);
// bitfield macros
#define _RPOR20_21_RPO20R_POSN                              0x0
#define _RPOR20_21_RPO20R_POSITION                          0x0
#define _RPOR20_21_RPO20R_SIZE                              0x4
#define _RPOR20_21_RPO20R_LENGTH                            0x4
#define _RPOR20_21_RPO20R_MASK                              0xF
#define _RPOR20_21_RPO21R_POSN                              0x4
#define _RPOR20_21_RPO21R_POSITION                          0x4
#define _RPOR20_21_RPO21R_SIZE                              0x4
#define _RPOR20_21_RPO21R_LENGTH                            0x4
#define _RPOR20_21_RPO21R_MASK                              0xF0
#define _RPOR20_21_RPO20R0_POSN                             0x0
#define _RPOR20_21_RPO20R0_POSITION                         0x0
#define _RPOR20_21_RPO20R0_SIZE                             0x1
#define _RPOR20_21_RPO20R0_LENGTH                           0x1
#define _RPOR20_21_RPO20R0_MASK                             0x1
#define _RPOR20_21_RPO20R1_POSN                             0x1
#define _RPOR20_21_RPO20R1_POSITION                         0x1
#define _RPOR20_21_RPO20R1_SIZE                             0x1
#define _RPOR20_21_RPO20R1_LENGTH                           0x1
#define _RPOR20_21_RPO20R1_MASK                             0x2
#define _RPOR20_21_RPO20R2_POSN                             0x2
#define _RPOR20_21_RPO20R2_POSITION                         0x2
#define _RPOR20_21_RPO20R2_SIZE                             0x1
#define _RPOR20_21_RPO20R2_LENGTH                           0x1
#define _RPOR20_21_RPO20R2_MASK                             0x4
#define _RPOR20_21_RPO20R3_POSN                             0x3
#define _RPOR20_21_RPO20R3_POSITION                         0x3
#define _RPOR20_21_RPO20R3_SIZE                             0x1
#define _RPOR20_21_RPO20R3_LENGTH                           0x1
#define _RPOR20_21_RPO20R3_MASK                             0x8
#define _RPOR20_21_RPO21R0_POSN                             0x4
#define _RPOR20_21_RPO21R0_POSITION                         0x4
#define _RPOR20_21_RPO21R0_SIZE                             0x1
#define _RPOR20_21_RPO21R0_LENGTH                           0x1
#define _RPOR20_21_RPO21R0_MASK                             0x10
#define _RPOR20_21_RPO21R1_POSN                             0x5
#define _RPOR20_21_RPO21R1_POSITION                         0x5
#define _RPOR20_21_RPO21R1_SIZE                             0x1
#define _RPOR20_21_RPO21R1_LENGTH                           0x1
#define _RPOR20_21_RPO21R1_MASK                             0x20
#define _RPOR20_21_RPO21R2_POSN                             0x6
#define _RPOR20_21_RPO21R2_POSITION                         0x6
#define _RPOR20_21_RPO21R2_SIZE                             0x1
#define _RPOR20_21_RPO21R2_LENGTH                           0x1
#define _RPOR20_21_RPO21R2_MASK                             0x40
#define _RPOR20_21_RPO21R3_POSN                             0x7
#define _RPOR20_21_RPO21R3_POSITION                         0x7
#define _RPOR20_21_RPO21R3_SIZE                             0x1
#define _RPOR20_21_RPO21R3_LENGTH                           0x1
#define _RPOR20_21_RPO21R3_MASK                             0x80

// Register: RPOR22_23
#define RPOR22_23 RPOR22_23
extern volatile unsigned char           RPOR22_23           __at(0xE1D);
#ifndef _LIB_BUILD
asm("RPOR22_23 equ 0E1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO22R                 :4;
        unsigned RPO23R                 :4;
    };
    struct {
        unsigned RPO22R0                :1;
        unsigned RPO22R1                :1;
        unsigned RPO22R2                :1;
        unsigned RPO22R3                :1;
        unsigned RPO23R0                :1;
        unsigned RPO23R1                :1;
        unsigned RPO23R2                :1;
        unsigned RPO23R3                :1;
    };
} RPOR22_23bits_t;
extern volatile RPOR22_23bits_t RPOR22_23bits __at(0xE1D);
// bitfield macros
#define _RPOR22_23_RPO22R_POSN                              0x0
#define _RPOR22_23_RPO22R_POSITION                          0x0
#define _RPOR22_23_RPO22R_SIZE                              0x4
#define _RPOR22_23_RPO22R_LENGTH                            0x4
#define _RPOR22_23_RPO22R_MASK                              0xF
#define _RPOR22_23_RPO23R_POSN                              0x4
#define _RPOR22_23_RPO23R_POSITION                          0x4
#define _RPOR22_23_RPO23R_SIZE                              0x4
#define _RPOR22_23_RPO23R_LENGTH                            0x4
#define _RPOR22_23_RPO23R_MASK                              0xF0
#define _RPOR22_23_RPO22R0_POSN                             0x0
#define _RPOR22_23_RPO22R0_POSITION                         0x0
#define _RPOR22_23_RPO22R0_SIZE                             0x1
#define _RPOR22_23_RPO22R0_LENGTH                           0x1
#define _RPOR22_23_RPO22R0_MASK                             0x1
#define _RPOR22_23_RPO22R1_POSN                             0x1
#define _RPOR22_23_RPO22R1_POSITION                         0x1
#define _RPOR22_23_RPO22R1_SIZE                             0x1
#define _RPOR22_23_RPO22R1_LENGTH                           0x1
#define _RPOR22_23_RPO22R1_MASK                             0x2
#define _RPOR22_23_RPO22R2_POSN                             0x2
#define _RPOR22_23_RPO22R2_POSITION                         0x2
#define _RPOR22_23_RPO22R2_SIZE                             0x1
#define _RPOR22_23_RPO22R2_LENGTH                           0x1
#define _RPOR22_23_RPO22R2_MASK                             0x4
#define _RPOR22_23_RPO22R3_POSN                             0x3
#define _RPOR22_23_RPO22R3_POSITION                         0x3
#define _RPOR22_23_RPO22R3_SIZE                             0x1
#define _RPOR22_23_RPO22R3_LENGTH                           0x1
#define _RPOR22_23_RPO22R3_MASK                             0x8
#define _RPOR22_23_RPO23R0_POSN                             0x4
#define _RPOR22_23_RPO23R0_POSITION                         0x4
#define _RPOR22_23_RPO23R0_SIZE                             0x1
#define _RPOR22_23_RPO23R0_LENGTH                           0x1
#define _RPOR22_23_RPO23R0_MASK                             0x10
#define _RPOR22_23_RPO23R1_POSN                             0x5
#define _RPOR22_23_RPO23R1_POSITION                         0x5
#define _RPOR22_23_RPO23R1_SIZE                             0x1
#define _RPOR22_23_RPO23R1_LENGTH                           0x1
#define _RPOR22_23_RPO23R1_MASK                             0x20
#define _RPOR22_23_RPO23R2_POSN                             0x6
#define _RPOR22_23_RPO23R2_POSITION                         0x6
#define _RPOR22_23_RPO23R2_SIZE                             0x1
#define _RPOR22_23_RPO23R2_LENGTH                           0x1
#define _RPOR22_23_RPO23R2_MASK                             0x40
#define _RPOR22_23_RPO23R3_POSN                             0x7
#define _RPOR22_23_RPO23R3_POSITION                         0x7
#define _RPOR22_23_RPO23R3_SIZE                             0x1
#define _RPOR22_23_RPO23R3_LENGTH                           0x1
#define _RPOR22_23_RPO23R3_MASK                             0x80

// Register: RPOR24_25
#define RPOR24_25 RPOR24_25
extern volatile unsigned char           RPOR24_25           __at(0xE1E);
#ifndef _LIB_BUILD
asm("RPOR24_25 equ 0E1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO24R                 :4;
        unsigned RPO25R                 :4;
    };
    struct {
        unsigned RPO24R0                :1;
        unsigned RPO24R1                :1;
        unsigned RPO24R2                :1;
        unsigned RPO24R3                :1;
        unsigned RPO25R0                :1;
        unsigned RPO25R1                :1;
        unsigned RPO25R2                :1;
        unsigned RPO25R3                :1;
    };
} RPOR24_25bits_t;
