MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J94/mcu.h
// Register: LCDDATA43
#define LCDDATA43 LCDDATA43
extern volatile unsigned char           LCDDATA43           __at(0xEB9);
#ifndef _LIB_BUILD
asm("LCDDATA43 equ 0EB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C5                  :1;
        unsigned S25C5                  :1;
        unsigned S26C5                  :1;
        unsigned S27C5                  :1;
        unsigned S28C5                  :1;
        unsigned S29C5                  :1;
        unsigned S30C5                  :1;
        unsigned S31C5                  :1;
    };
} LCDDATA43bits_t;
extern volatile LCDDATA43bits_t LCDDATA43bits __at(0xEB9);
// bitfield macros
#define _LCDDATA43_S24C5_POSN                               0x0
#define _LCDDATA43_S24C5_POSITION                           0x0
#define _LCDDATA43_S24C5_SIZE                               0x1
#define _LCDDATA43_S24C5_LENGTH                             0x1
#define _LCDDATA43_S24C5_MASK                               0x1
#define _LCDDATA43_S25C5_POSN                               0x1
#define _LCDDATA43_S25C5_POSITION                           0x1
#define _LCDDATA43_S25C5_SIZE                               0x1
#define _LCDDATA43_S25C5_LENGTH                             0x1
#define _LCDDATA43_S25C5_MASK                               0x2
#define _LCDDATA43_S26C5_POSN                               0x2
#define _LCDDATA43_S26C5_POSITION                           0x2
#define _LCDDATA43_S26C5_SIZE                               0x1
#define _LCDDATA43_S26C5_LENGTH                             0x1
#define _LCDDATA43_S26C5_MASK                               0x4
#define _LCDDATA43_S27C5_POSN                               0x3
#define _LCDDATA43_S27C5_POSITION                           0x3
#define _LCDDATA43_S27C5_SIZE                               0x1
#define _LCDDATA43_S27C5_LENGTH                             0x1
#define _LCDDATA43_S27C5_MASK                               0x8
#define _LCDDATA43_S28C5_POSN                               0x4
#define _LCDDATA43_S28C5_POSITION                           0x4
#define _LCDDATA43_S28C5_SIZE                               0x1
#define _LCDDATA43_S28C5_LENGTH                             0x1
#define _LCDDATA43_S28C5_MASK                               0x10
#define _LCDDATA43_S29C5_POSN                               0x5
#define _LCDDATA43_S29C5_POSITION                           0x5
#define _LCDDATA43_S29C5_SIZE                               0x1
#define _LCDDATA43_S29C5_LENGTH                             0x1
#define _LCDDATA43_S29C5_MASK                               0x20
#define _LCDDATA43_S30C5_POSN                               0x6
#define _LCDDATA43_S30C5_POSITION                           0x6
#define _LCDDATA43_S30C5_SIZE                               0x1
#define _LCDDATA43_S30C5_LENGTH                             0x1
#define _LCDDATA43_S30C5_MASK                               0x40
#define _LCDDATA43_S31C5_POSN                               0x7
#define _LCDDATA43_S31C5_POSITION                           0x7
#define _LCDDATA43_S31C5_SIZE                               0x1
#define _LCDDATA43_S31C5_LENGTH                             0x1
#define _LCDDATA43_S31C5_MASK                               0x80

// Register: LCDDATA44
#define LCDDATA44 LCDDATA44
extern volatile unsigned char           LCDDATA44           __at(0xEBA);
#ifndef _LIB_BUILD
asm("LCDDATA44 equ 0EBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C5                  :1;
        unsigned S33C5                  :1;
        unsigned S34C5                  :1;
        unsigned S35C5                  :1;
        unsigned S36C5                  :1;
        unsigned S37C5                  :1;
        unsigned S38C5                  :1;
        unsigned S39C5                  :1;
    };
} LCDDATA44bits_t;
extern volatile LCDDATA44bits_t LCDDATA44bits __at(0xEBA);
// bitfield macros
#define _LCDDATA44_S32C5_POSN                               0x0
#define _LCDDATA44_S32C5_POSITION                           0x0
#define _LCDDATA44_S32C5_SIZE                               0x1
#define _LCDDATA44_S32C5_LENGTH                             0x1
#define _LCDDATA44_S32C5_MASK                               0x1
#define _LCDDATA44_S33C5_POSN                               0x1
#define _LCDDATA44_S33C5_POSITION                           0x1
#define _LCDDATA44_S33C5_SIZE                               0x1
#define _LCDDATA44_S33C5_LENGTH                             0x1
#define _LCDDATA44_S33C5_MASK                               0x2
#define _LCDDATA44_S34C5_POSN                               0x2
#define _LCDDATA44_S34C5_POSITION                           0x2
#define _LCDDATA44_S34C5_SIZE                               0x1
#define _LCDDATA44_S34C5_LENGTH                             0x1
#define _LCDDATA44_S34C5_MASK                               0x4
#define _LCDDATA44_S35C5_POSN                               0x3
#define _LCDDATA44_S35C5_POSITION                           0x3
#define _LCDDATA44_S35C5_SIZE                               0x1
#define _LCDDATA44_S35C5_LENGTH                             0x1
#define _LCDDATA44_S35C5_MASK                               0x8
#define _LCDDATA44_S36C5_POSN                               0x4
#define _LCDDATA44_S36C5_POSITION                           0x4
#define _LCDDATA44_S36C5_SIZE                               0x1
#define _LCDDATA44_S36C5_LENGTH                             0x1
#define _LCDDATA44_S36C5_MASK                               0x10
#define _LCDDATA44_S37C5_POSN                               0x5
#define _LCDDATA44_S37C5_POSITION                           0x5
#define _LCDDATA44_S37C5_SIZE                               0x1
#define _LCDDATA44_S37C5_LENGTH                             0x1
#define _LCDDATA44_S37C5_MASK                               0x20
#define _LCDDATA44_S38C5_POSN                               0x6
#define _LCDDATA44_S38C5_POSITION                           0x6
#define _LCDDATA44_S38C5_SIZE                               0x1
#define _LCDDATA44_S38C5_LENGTH                             0x1
#define _LCDDATA44_S38C5_MASK                               0x40
#define _LCDDATA44_S39C5_POSN                               0x7
#define _LCDDATA44_S39C5_POSITION                           0x7
#define _LCDDATA44_S39C5_SIZE                               0x1
#define _LCDDATA44_S39C5_LENGTH                             0x1
#define _LCDDATA44_S39C5_MASK                               0x80

// Register: LCDDATA45
#define LCDDATA45 LCDDATA45
extern volatile unsigned char           LCDDATA45           __at(0xEBB);
#ifndef _LIB_BUILD
asm("LCDDATA45 equ 0EBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C5                  :1;
        unsigned S41C5                  :1;
        unsigned S42C5                  :1;
        unsigned S43C5                  :1;
        unsigned S44C5                  :1;
        unsigned S45C5                  :1;
        unsigned S46C5                  :1;
        unsigned S47C5                  :1;
    };
} LCDDATA45bits_t;
extern volatile LCDDATA45bits_t LCDDATA45bits __at(0xEBB);
// bitfield macros
#define _LCDDATA45_S40C5_POSN                               0x0
#define _LCDDATA45_S40C5_POSITION                           0x0
#define _LCDDATA45_S40C5_SIZE                               0x1
#define _LCDDATA45_S40C5_LENGTH                             0x1
#define _LCDDATA45_S40C5_MASK                               0x1
#define _LCDDATA45_S41C5_POSN                               0x1
#define _LCDDATA45_S41C5_POSITION                           0x1
#define _LCDDATA45_S41C5_SIZE                               0x1
#define _LCDDATA45_S41C5_LENGTH                             0x1
#define _LCDDATA45_S41C5_MASK                               0x2
#define _LCDDATA45_S42C5_POSN                               0x2
#define _LCDDATA45_S42C5_POSITION                           0x2
#define _LCDDATA45_S42C5_SIZE                               0x1
#define _LCDDATA45_S42C5_LENGTH                             0x1
#define _LCDDATA45_S42C5_MASK                               0x4
#define _LCDDATA45_S43C5_POSN                               0x3
#define _LCDDATA45_S43C5_POSITION                           0x3
#define _LCDDATA45_S43C5_SIZE                               0x1
#define _LCDDATA45_S43C5_LENGTH                             0x1
#define _LCDDATA45_S43C5_MASK                               0x8
#define _LCDDATA45_S44C5_POSN                               0x4
#define _LCDDATA45_S44C5_POSITION                           0x4
#define _LCDDATA45_S44C5_SIZE                               0x1
#define _LCDDATA45_S44C5_LENGTH                             0x1
#define _LCDDATA45_S44C5_MASK                               0x10
#define _LCDDATA45_S45C5_POSN                               0x5
#define _LCDDATA45_S45C5_POSITION                           0x5
#define _LCDDATA45_S45C5_SIZE                               0x1
#define _LCDDATA45_S45C5_LENGTH                             0x1
#define _LCDDATA45_S45C5_MASK                               0x20
#define _LCDDATA45_S46C5_POSN                               0x6
#define _LCDDATA45_S46C5_POSITION                           0x6
#define _LCDDATA45_S46C5_SIZE                               0x1
#define _LCDDATA45_S46C5_LENGTH                             0x1
#define _LCDDATA45_S46C5_MASK                               0x40
#define _LCDDATA45_S47C5_POSN                               0x7
#define _LCDDATA45_S47C5_POSITION                           0x7
#define _LCDDATA45_S47C5_SIZE                               0x1
#define _LCDDATA45_S47C5_LENGTH                             0x1
#define _LCDDATA45_S47C5_MASK                               0x80

// Register: LCDDATA46
#define LCDDATA46 LCDDATA46
extern volatile unsigned char           LCDDATA46           __at(0xEBC);
#ifndef _LIB_BUILD
asm("LCDDATA46 equ 0EBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S48C5                  :1;
        unsigned S49C5                  :1;
        unsigned S50C5                  :1;
        unsigned S51C5                  :1;
        unsigned S52C5                  :1;
        unsigned S53C5                  :1;
        unsigned S54C5                  :1;
        unsigned S55C5                  :1;
    };
} LCDDATA46bits_t;
extern volatile LCDDATA46bits_t LCDDATA46bits __at(0xEBC);
// bitfield macros
#define _LCDDATA46_S48C5_POSN                               0x0
#define _LCDDATA46_S48C5_POSITION                           0x0
#define _LCDDATA46_S48C5_SIZE                               0x1
#define _LCDDATA46_S48C5_LENGTH                             0x1
#define _LCDDATA46_S48C5_MASK                               0x1
#define _LCDDATA46_S49C5_POSN                               0x1
#define _LCDDATA46_S49C5_POSITION                           0x1
#define _LCDDATA46_S49C5_SIZE                               0x1
#define _LCDDATA46_S49C5_LENGTH                             0x1
#define _LCDDATA46_S49C5_MASK                               0x2
#define _LCDDATA46_S50C5_POSN                               0x2
#define _LCDDATA46_S50C5_POSITION                           0x2
#define _LCDDATA46_S50C5_SIZE                               0x1
#define _LCDDATA46_S50C5_LENGTH                             0x1
#define _LCDDATA46_S50C5_MASK                               0x4
#define _LCDDATA46_S51C5_POSN                               0x3
#define _LCDDATA46_S51C5_POSITION                           0x3
#define _LCDDATA46_S51C5_SIZE                               0x1
#define _LCDDATA46_S51C5_LENGTH                             0x1
#define _LCDDATA46_S51C5_MASK                               0x8
#define _LCDDATA46_S52C5_POSN                               0x4
#define _LCDDATA46_S52C5_POSITION                           0x4
#define _LCDDATA46_S52C5_SIZE                               0x1
#define _LCDDATA46_S52C5_LENGTH                             0x1
#define _LCDDATA46_S52C5_MASK                               0x10
#define _LCDDATA46_S53C5_POSN                               0x5
#define _LCDDATA46_S53C5_POSITION                           0x5
#define _LCDDATA46_S53C5_SIZE                               0x1
#define _LCDDATA46_S53C5_LENGTH                             0x1
#define _LCDDATA46_S53C5_MASK                               0x20
#define _LCDDATA46_S54C5_POSN                               0x6
#define _LCDDATA46_S54C5_POSITION                           0x6
#define _LCDDATA46_S54C5_SIZE                               0x1
#define _LCDDATA46_S54C5_LENGTH                             0x1
#define _LCDDATA46_S54C5_MASK                               0x40
#define _LCDDATA46_S55C5_POSN                               0x7
#define _LCDDATA46_S55C5_POSITION                           0x7
#define _LCDDATA46_S55C5_SIZE                               0x1
#define _LCDDATA46_S55C5_LENGTH                             0x1
#define _LCDDATA46_S55C5_MASK                               0x80

// Register: LCDDATA47
#define LCDDATA47 LCDDATA47
extern volatile unsigned char           LCDDATA47           __at(0xEBD);
#ifndef _LIB_BUILD
asm("LCDDATA47 equ 0EBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S56C5                  :1;
        unsigned S57C5                  :1;
        unsigned S58C5                  :1;
        unsigned S59C5                  :1;
        unsigned S60C5                  :1;
        unsigned S61C5                  :1;
        unsigned S62C5                  :1;
        unsigned S63C5                  :1;
    };
} LCDDATA47bits_t;
