MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J94/mcu.h
// Register: PADCFG1
#define PADCFG1 PADCFG1
extern volatile unsigned char           PADCFG1             __at(0xF54);
#ifndef _LIB_BUILD
asm("PADCFG1 equ 0F54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RLPU                   :1;
        unsigned RKPU                   :1;
        unsigned RJPU                   :1;
        unsigned RHPU                   :1;
        unsigned RGPU                   :1;
        unsigned RFPU                   :1;
        unsigned REPU                   :1;
        unsigned RDPU                   :1;
    };
    struct {
        unsigned PMPTTL                 :1;
    };
} PADCFG1bits_t;
extern volatile PADCFG1bits_t PADCFG1bits __at(0xF54);
// bitfield macros
#define _PADCFG1_RLPU_POSN                                  0x0
#define _PADCFG1_RLPU_POSITION                              0x0
#define _PADCFG1_RLPU_SIZE                                  0x1
#define _PADCFG1_RLPU_LENGTH                                0x1
#define _PADCFG1_RLPU_MASK                                  0x1
#define _PADCFG1_RKPU_POSN                                  0x1
#define _PADCFG1_RKPU_POSITION                              0x1
#define _PADCFG1_RKPU_SIZE                                  0x1
#define _PADCFG1_RKPU_LENGTH                                0x1
#define _PADCFG1_RKPU_MASK                                  0x2
#define _PADCFG1_RJPU_POSN                                  0x2
#define _PADCFG1_RJPU_POSITION                              0x2
#define _PADCFG1_RJPU_SIZE                                  0x1
#define _PADCFG1_RJPU_LENGTH                                0x1
#define _PADCFG1_RJPU_MASK                                  0x4
#define _PADCFG1_RHPU_POSN                                  0x3
#define _PADCFG1_RHPU_POSITION                              0x3
#define _PADCFG1_RHPU_SIZE                                  0x1
#define _PADCFG1_RHPU_LENGTH                                0x1
#define _PADCFG1_RHPU_MASK                                  0x8
#define _PADCFG1_RGPU_POSN                                  0x4
#define _PADCFG1_RGPU_POSITION                              0x4
#define _PADCFG1_RGPU_SIZE                                  0x1
#define _PADCFG1_RGPU_LENGTH                                0x1
#define _PADCFG1_RGPU_MASK                                  0x10
#define _PADCFG1_RFPU_POSN                                  0x5
#define _PADCFG1_RFPU_POSITION                              0x5
#define _PADCFG1_RFPU_SIZE                                  0x1
#define _PADCFG1_RFPU_LENGTH                                0x1
#define _PADCFG1_RFPU_MASK                                  0x20
#define _PADCFG1_REPU_POSN                                  0x6
#define _PADCFG1_REPU_POSITION                              0x6
#define _PADCFG1_REPU_SIZE                                  0x1
#define _PADCFG1_REPU_LENGTH                                0x1
#define _PADCFG1_REPU_MASK                                  0x40
#define _PADCFG1_RDPU_POSN                                  0x7
#define _PADCFG1_RDPU_POSITION                              0x7
#define _PADCFG1_RDPU_SIZE                                  0x1
#define _PADCFG1_RDPU_LENGTH                                0x1
#define _PADCFG1_RDPU_MASK                                  0x80
#define _PADCFG1_PMPTTL_POSN                                0x0
#define _PADCFG1_PMPTTL_POSITION                            0x0
#define _PADCFG1_PMPTTL_SIZE                                0x1
#define _PADCFG1_PMPTTL_LENGTH                              0x1
#define _PADCFG1_PMPTTL_MASK                                0x1

// Register: IOCN
#define IOCN IOCN
extern volatile unsigned char           IOCN                __at(0xF55);
#ifndef _LIB_BUILD
asm("IOCN equ 0F55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCN0                  :1;
        unsigned IOCN1                  :1;
        unsigned IOCN2                  :1;
        unsigned IOCN3                  :1;
        unsigned IOCN4                  :1;
        unsigned IOCN5                  :1;
        unsigned IOCN6                  :1;
        unsigned IOCN7                  :1;
    };
} IOCNbits_t;
extern volatile IOCNbits_t IOCNbits __at(0xF55);
// bitfield macros
#define _IOCN_IOCN0_POSN                                    0x0
#define _IOCN_IOCN0_POSITION                                0x0
#define _IOCN_IOCN0_SIZE                                    0x1
#define _IOCN_IOCN0_LENGTH                                  0x1
#define _IOCN_IOCN0_MASK                                    0x1
#define _IOCN_IOCN1_POSN                                    0x1
#define _IOCN_IOCN1_POSITION                                0x1
#define _IOCN_IOCN1_SIZE                                    0x1
#define _IOCN_IOCN1_LENGTH                                  0x1
#define _IOCN_IOCN1_MASK                                    0x2
#define _IOCN_IOCN2_POSN                                    0x2
#define _IOCN_IOCN2_POSITION                                0x2
#define _IOCN_IOCN2_SIZE                                    0x1
#define _IOCN_IOCN2_LENGTH                                  0x1
#define _IOCN_IOCN2_MASK                                    0x4
#define _IOCN_IOCN3_POSN                                    0x3
#define _IOCN_IOCN3_POSITION                                0x3
#define _IOCN_IOCN3_SIZE                                    0x1
#define _IOCN_IOCN3_LENGTH                                  0x1
#define _IOCN_IOCN3_MASK                                    0x8
#define _IOCN_IOCN4_POSN                                    0x4
#define _IOCN_IOCN4_POSITION                                0x4
#define _IOCN_IOCN4_SIZE                                    0x1
#define _IOCN_IOCN4_LENGTH                                  0x1
#define _IOCN_IOCN4_MASK                                    0x10
#define _IOCN_IOCN5_POSN                                    0x5
#define _IOCN_IOCN5_POSITION                                0x5
#define _IOCN_IOCN5_SIZE                                    0x1
#define _IOCN_IOCN5_LENGTH                                  0x1
#define _IOCN_IOCN5_MASK                                    0x20
#define _IOCN_IOCN6_POSN                                    0x6
#define _IOCN_IOCN6_POSITION                                0x6
#define _IOCN_IOCN6_SIZE                                    0x1
#define _IOCN_IOCN6_LENGTH                                  0x1
#define _IOCN_IOCN6_MASK                                    0x40
#define _IOCN_IOCN7_POSN                                    0x7
#define _IOCN_IOCN7_POSITION                                0x7
#define _IOCN_IOCN7_SIZE                                    0x1
#define _IOCN_IOCN7_LENGTH                                  0x1
#define _IOCN_IOCN7_MASK                                    0x80

