MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J94/mcu.h
extern volatile __bit                   MDCHODIS            __at(0x776F);	// @ (0xEED * 8 + 7)
#define                                 MDCHODIS_bit        _BIT_ACCESS(MDCARH,7)
// MDCARH<MDCHPOL>
extern volatile __bit                   MDCHPOL             __at(0x776E);	// @ (0xEED * 8 + 6)
#define                                 MDCHPOL_bit         _BIT_ACCESS(MDCARH,6)
// MDCARH<MDCHSYNC>
extern volatile __bit                   MDCHSYNC            __at(0x776D);	// @ (0xEED * 8 + 5)
#define                                 MDCHSYNC_bit        _BIT_ACCESS(MDCARH,5)
// RPINR30_31<MDCIN1R0>
extern volatile __bit                   MDCIN1R0            __at(0x71C8);	// @ (0xE39 * 8 + 0)
#define                                 MDCIN1R0_bit        _BIT_ACCESS(RPINR30_31,0)
// RPINR30_31<MDCIN1R1>
extern volatile __bit                   MDCIN1R1            __at(0x71C9);	// @ (0xE39 * 8 + 1)
#define                                 MDCIN1R1_bit        _BIT_ACCESS(RPINR30_31,1)
// RPINR30_31<MDCIN1R2>
extern volatile __bit                   MDCIN1R2            __at(0x71CA);	// @ (0xE39 * 8 + 2)
#define                                 MDCIN1R2_bit        _BIT_ACCESS(RPINR30_31,2)
// RPINR30_31<MDCIN1R3>
extern volatile __bit                   MDCIN1R3            __at(0x71CB);	// @ (0xE39 * 8 + 3)
#define                                 MDCIN1R3_bit        _BIT_ACCESS(RPINR30_31,3)
// RPINR30_31<MDCIN2R0>
extern volatile __bit                   MDCIN2R0            __at(0x71CC);	// @ (0xE39 * 8 + 4)
#define                                 MDCIN2R0_bit        _BIT_ACCESS(RPINR30_31,4)
// RPINR30_31<MDCIN2R1>
extern volatile __bit                   MDCIN2R1            __at(0x71CD);	// @ (0xE39 * 8 + 5)
#define                                 MDCIN2R1_bit        _BIT_ACCESS(RPINR30_31,5)
// RPINR30_31<MDCIN2R2>
extern volatile __bit                   MDCIN2R2            __at(0x71CE);	// @ (0xE39 * 8 + 6)
#define                                 MDCIN2R2_bit        _BIT_ACCESS(RPINR30_31,6)
// RPINR30_31<MDCIN2R3>
extern volatile __bit                   MDCIN2R3            __at(0x71CF);	// @ (0xE39 * 8 + 7)
#define                                 MDCIN2R3_bit        _BIT_ACCESS(RPINR30_31,7)
// MDCARL<MDCL0>
extern volatile __bit                   MDCL0               __at(0x7760);	// @ (0xEEC * 8 + 0)
#define                                 MDCL0_bit           _BIT_ACCESS(MDCARL,0)
// MDCARL<MDCL1>
extern volatile __bit                   MDCL1               __at(0x7761);	// @ (0xEEC * 8 + 1)
#define                                 MDCL1_bit           _BIT_ACCESS(MDCARL,1)
// MDCARL<MDCL2>
extern volatile __bit                   MDCL2               __at(0x7762);	// @ (0xEEC * 8 + 2)
#define                                 MDCL2_bit           _BIT_ACCESS(MDCARL,2)
// MDCARL<MDCL3>
extern volatile __bit                   MDCL3               __at(0x7763);	// @ (0xEEC * 8 + 3)
#define                                 MDCL3_bit           _BIT_ACCESS(MDCARL,3)
// MDCARL<MDCLODIS>
extern volatile __bit                   MDCLODIS            __at(0x7767);	// @ (0xEEC * 8 + 7)
#define                                 MDCLODIS_bit        _BIT_ACCESS(MDCARL,7)
// MDCARL<MDCLPOL>
extern volatile __bit                   MDCLPOL             __at(0x7766);	// @ (0xEEC * 8 + 6)
#define                                 MDCLPOL_bit         _BIT_ACCESS(MDCARL,6)
// MDCARL<MDCLSYNC>
extern volatile __bit                   MDCLSYNC            __at(0x7765);	// @ (0xEEC * 8 + 5)
#define                                 MDCLSYNC_bit        _BIT_ACCESS(MDCARL,5)
// MDCON<MDEN>
extern volatile __bit                   MDEN                __at(0x777F);	// @ (0xEEF * 8 + 7)
#define                                 MDEN_bit            _BIT_ACCESS(MDCON,7)
// RPINR28_29<MDMINR0>
extern volatile __bit                   MDMINR0             __at(0x71C4);	// @ (0xE38 * 8 + 4)
#define                                 MDMINR0_bit         _BIT_ACCESS(RPINR28_29,4)
// RPINR28_29<MDMINR1>
extern volatile __bit                   MDMINR1             __at(0x71C5);	// @ (0xE38 * 8 + 5)
#define                                 MDMINR1_bit         _BIT_ACCESS(RPINR28_29,5)
// RPINR28_29<MDMINR2>
extern volatile __bit                   MDMINR2             __at(0x71C6);	// @ (0xE38 * 8 + 6)
#define                                 MDMINR2_bit         _BIT_ACCESS(RPINR28_29,6)
// RPINR28_29<MDMINR3>
extern volatile __bit                   MDMINR3             __at(0x71C7);	// @ (0xE38 * 8 + 7)
#define                                 MDMINR3_bit         _BIT_ACCESS(RPINR28_29,7)
// MDCON<MDO>
extern volatile __bit                   MDO                 __at(0x777B);	// @ (0xEEF * 8 + 3)
#define                                 MDO_bit             _BIT_ACCESS(MDCON,3)
// MDCON<MDOE>
extern volatile __bit                   MDOE                __at(0x777E);	// @ (0xEEF * 8 + 6)
#define                                 MDOE_bit            _BIT_ACCESS(MDCON,6)
// MDCON<MDOPOL>
extern volatile __bit                   MDOPOL              __at(0x777C);	// @ (0xEEF * 8 + 4)
#define                                 MDOPOL_bit          _BIT_ACCESS(MDCON,4)
// MDCON<MDSLR>
extern volatile __bit                   MDSLR               __at(0x777D);	// @ (0xEEF * 8 + 5)
#define                                 MDSLR_bit           _BIT_ACCESS(MDCON,5)
// MDSRC<MDSODIS>
extern volatile __bit                   MDSODIS             __at(0x7777);	// @ (0xEEE * 8 + 7)
#define                                 MDSODIS_bit         _BIT_ACCESS(MDSRC,7)
// MDSRC<MDSRC0>
extern volatile __bit                   MDSRC0              __at(0x7770);	// @ (0xEEE * 8 + 0)
#define                                 MDSRC0_bit          _BIT_ACCESS(MDSRC,0)
// MDSRC<MDSRC1>
extern volatile __bit                   MDSRC1              __at(0x7771);	// @ (0xEEE * 8 + 1)
#define                                 MDSRC1_bit          _BIT_ACCESS(MDSRC,1)
// MDSRC<MDSRC2>
extern volatile __bit                   MDSRC2              __at(0x7772);	// @ (0xEEE * 8 + 2)
#define                                 MDSRC2_bit          _BIT_ACCESS(MDSRC,2)
// MDSRC<MDSRC3>
extern volatile __bit                   MDSRC3              __at(0x7773);	// @ (0xEEE * 8 + 3)
#define                                 MDSRC3_bit          _BIT_ACCESS(MDSRC,3)
// ADCON1H<MODE12>
extern volatile __bit                   MODE12              __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 MODE12_bit          _BIT_ACCESS(ADCON1H,2)
// LCDREG<MODE13>
extern volatile __bit                   MODE13              __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 MODE13_bit          _BIT_ACCESS(LCDREG,2)
// PMD3<MODMD>
extern volatile __bit                   MODMD               __at(0x778F);	// @ (0xEF1 * 8 + 7)
#define                                 MODMD_bit           _BIT_ACCESS(PMD3,7)
// SSP1ADD<MSK01>
extern volatile __bit                   MSK01               __at(0x7E40);	// @ (0xFC8 * 8 + 0)
#define                                 MSK01_bit           _BIT_ACCESS(SSP1ADD,0)
// SSP2ADD<MSK02>
extern volatile __bit                   MSK02               __at(0x7810);	// @ (0xF02 * 8 + 0)
#define                                 MSK02_bit           _BIT_ACCESS(SSP2ADD,0)
// SSP1ADD<MSK11>
extern volatile __bit                   MSK11               __at(0x7E41);	// @ (0xFC8 * 8 + 1)
#define                                 MSK11_bit           _BIT_ACCESS(SSP1ADD,1)
// SSP2ADD<MSK12>
extern volatile __bit                   MSK12               __at(0x7811);	// @ (0xF02 * 8 + 1)
#define                                 MSK12_bit           _BIT_ACCESS(SSP2ADD,1)
// SSP1ADD<MSK21>
extern volatile __bit                   MSK21               __at(0x7E42);	// @ (0xFC8 * 8 + 2)
#define                                 MSK21_bit           _BIT_ACCESS(SSP1ADD,2)
// SSP2ADD<MSK22>
extern volatile __bit                   MSK22               __at(0x7812);	// @ (0xF02 * 8 + 2)
#define                                 MSK22_bit           _BIT_ACCESS(SSP2ADD,2)
// SSP1ADD<MSK31>
extern volatile __bit                   MSK31               __at(0x7E43);	// @ (0xFC8 * 8 + 3)
#define                                 MSK31_bit           _BIT_ACCESS(SSP1ADD,3)
// SSP2ADD<MSK32>
extern volatile __bit                   MSK32               __at(0x7813);	// @ (0xF02 * 8 + 3)
#define                                 MSK32_bit           _BIT_ACCESS(SSP2ADD,3)
// SSP1ADD<MSK41>
extern volatile __bit                   MSK41               __at(0x7E44);	// @ (0xFC8 * 8 + 4)
#define                                 MSK41_bit           _BIT_ACCESS(SSP1ADD,4)
// SSP2ADD<MSK42>
extern volatile __bit                   MSK42               __at(0x7814);	// @ (0xF02 * 8 + 4)
#define                                 MSK42_bit           _BIT_ACCESS(SSP2ADD,4)
// SSP1ADD<MSK51>
extern volatile __bit                   MSK51               __at(0x7E45);	// @ (0xFC8 * 8 + 5)
#define                                 MSK51_bit           _BIT_ACCESS(SSP1ADD,5)
// SSP2ADD<MSK52>
extern volatile __bit                   MSK52               __at(0x7815);	// @ (0xF02 * 8 + 5)
#define                                 MSK52_bit           _BIT_ACCESS(SSP2ADD,5)
// SSP1ADD<MSK61>
extern volatile __bit                   MSK61               __at(0x7E46);	// @ (0xFC8 * 8 + 6)
#define                                 MSK61_bit           _BIT_ACCESS(SSP1ADD,6)
// SSP2ADD<MSK62>
extern volatile __bit                   MSK62               __at(0x7816);	// @ (0xF02 * 8 + 6)
#define                                 MSK62_bit           _BIT_ACCESS(SSP2ADD,6)
// SSP1ADD<MSK71>
extern volatile __bit                   MSK71               __at(0x7E47);	// @ (0xFC8 * 8 + 7)
#define                                 MSK71_bit           _BIT_ACCESS(SSP1ADD,7)
// SSP2ADD<MSK72>
extern volatile __bit                   MSK72               __at(0x7817);	// @ (0xF02 * 8 + 7)
#define                                 MSK72_bit           _BIT_ACCESS(SSP2ADD,7)
// STATUS<NEGATIVE>
extern volatile __bit                   NEGATIVE            __at(0x7EC4);	// @ (0xFD8 * 8 + 4)
#define                                 NEGATIVE_bit        _BIT_ACCESS(STATUS,4)
// OSCCON<NOSC0>
extern volatile __bit                   NOSC0               __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON,0)
// OSCCON<NOSC1>
extern volatile __bit                   NOSC1               __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON,1)
// OSCCON<NOSC2>
extern volatile __bit                   NOSC2               __at(0x7E9A);	// @ (0xFD3 * 8 + 2)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON,2)
// SSP1STAT<NOT_ADDRESS1>
extern volatile __bit                   NOT_ADDRESS1        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_ADDRESS1_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<NOT_ADDRESS2>
extern volatile __bit                   NOT_ADDRESS2        __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 NOT_ADDRESS2_bit    _BIT_ACCESS(SSP2STAT,5)
// RCON<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(RCON,0)
// RCON<NOT_CM>
extern volatile __bit                   NOT_CM              __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 NOT_CM_bit          _BIT_ACCESS(RCON,5)
// RCON<NOT_PD>
extern volatile __bit                   NOT_PD              __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 NOT_PD_bit          _BIT_ACCESS(RCON,2)
// RCON<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(RCON,1)
// INTCON2<NOT_RBPU>
extern volatile __bit                   NOT_RBPU            __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 NOT_RBPU_bit        _BIT_ACCESS(INTCON2,7)
// RCON<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 NOT_RI_bit          _BIT_ACCESS(RCON,4)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// T5GCON<NOT_T5DONE>
extern volatile __bit                   NOT_T5DONE          __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 NOT_T5DONE_bit      _BIT_ACCESS(T5GCON,3)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// RCON<NOT_TO>
extern volatile __bit                   NOT_TO              __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 NOT_TO_bit          _BIT_ACCESS(RCON,3)
// SSP1STAT<NOT_WRITE1>
extern volatile __bit                   NOT_WRITE1          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_WRITE1_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<NOT_WRITE2>
extern volatile __bit                   NOT_WRITE2          __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 NOT_WRITE2_bit      _BIT_ACCESS(SSP2STAT,2)
// ADCON2H<NVCFG0>
extern volatile __bit                   NVCFG0              __at(0x746D);	// @ (0xE8D * 8 + 5)
#define                                 NVCFG0_bit          _BIT_ACCESS(ADCON2H,5)
// PSPCON<OBF>
extern volatile __bit                   OBF                 __at(0x7D3E);	// @ (0xFA7 * 8 + 6)
#define                                 OBF_bit             _BIT_ACCESS(PSPCON,6)
// ADCON2H<OFFCAL>
extern volatile __bit                   OFFCAL              __at(0x746C);	// @ (0xE8D * 8 + 4)
#define                                 OFFCAL_bit          _BIT_ACCESS(ADCON2H,4)
// PIE2<OSCFIE>
extern volatile __bit                   OSCFIE              __at(0x7D07);	// @ (0xFA0 * 8 + 7)
#define                                 OSCFIE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<OSCFIF>
extern volatile __bit                   OSCFIF              __at(0x7D0F);	// @ (0xFA1 * 8 + 7)
#define                                 OSCFIF_bit          _BIT_ACCESS(PIR2,7)
// IPR2<OSCFIP>
extern volatile __bit                   OSCFIP              __at(0x7D17);	// @ (0xFA2 * 8 + 7)
#define                                 OSCFIP_bit          _BIT_ACCESS(IPR2,7)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// ECCP1DEL<P1DC0>
extern volatile __bit                   P1DC0               __at(0x7DE0);	// @ (0xFBC * 8 + 0)
#define                                 P1DC0_bit           _BIT_ACCESS(ECCP1DEL,0)
// PSTR1CON<P1DC02>
extern volatile __bit                   P1DC02              __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 P1DC02_bit          _BIT_ACCESS(PSTR1CON,0)
// PSTR1CON<P1DC0CON>
extern volatile __bit                   P1DC0CON            __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 P1DC0CON_bit        _BIT_ACCESS(PSTR1CON,0)
// ECCP1DEL<P1DC1>
extern volatile __bit                   P1DC1               __at(0x7DE1);	// @ (0xFBC * 8 + 1)
#define                                 P1DC1_bit           _BIT_ACCESS(ECCP1DEL,1)
// PSTR1CON<P1DC12>
extern volatile __bit                   P1DC12              __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 P1DC12_bit          _BIT_ACCESS(PSTR1CON,1)
// PSTR1CON<P1DC1CON>
extern volatile __bit                   P1DC1CON            __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 P1DC1CON_bit        _BIT_ACCESS(PSTR1CON,1)
// ECCP1DEL<P1DC2>
extern volatile __bit                   P1DC2               __at(0x7DE2);	// @ (0xFBC * 8 + 2)
#define                                 P1DC2_bit           _BIT_ACCESS(ECCP1DEL,2)
// PSTR1CON<P1DC22>
extern volatile __bit                   P1DC22              __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 P1DC22_bit          _BIT_ACCESS(PSTR1CON,2)
// PSTR1CON<P1DC2CON>
extern volatile __bit                   P1DC2CON            __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 P1DC2CON_bit        _BIT_ACCESS(PSTR1CON,2)
// ECCP1DEL<P1DC3>
extern volatile __bit                   P1DC3               __at(0x7DE3);	// @ (0xFBC * 8 + 3)
#define                                 P1DC3_bit           _BIT_ACCESS(ECCP1DEL,3)
// PSTR1CON<P1DC32>
extern volatile __bit                   P1DC32              __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 P1DC32_bit          _BIT_ACCESS(PSTR1CON,3)
// PSTR1CON<P1DC3CON>
extern volatile __bit                   P1DC3CON            __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 P1DC3CON_bit        _BIT_ACCESS(PSTR1CON,3)
// ECCP1DEL<P1DC4>
extern volatile __bit                   P1DC4               __at(0x7DE4);	// @ (0xFBC * 8 + 4)
#define                                 P1DC4_bit           _BIT_ACCESS(ECCP1DEL,4)
// PSTR1CON<P1DC42>
extern volatile __bit                   P1DC42              __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 P1DC42_bit          _BIT_ACCESS(PSTR1CON,4)
// PSTR1CON<P1DC4CON>
extern volatile __bit                   P1DC4CON            __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 P1DC4CON_bit        _BIT_ACCESS(PSTR1CON,4)
// ECCP1DEL<P1DC5>
extern volatile __bit                   P1DC5               __at(0x7DE5);	// @ (0xFBC * 8 + 5)
#define                                 P1DC5_bit           _BIT_ACCESS(ECCP1DEL,5)
// ECCP1DEL<P1DC6>
extern volatile __bit                   P1DC6               __at(0x7DE6);	// @ (0xFBC * 8 + 6)
#define                                 P1DC6_bit           _BIT_ACCESS(ECCP1DEL,6)
// PSTR1CON<P1DC62>
extern volatile __bit                   P1DC62              __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 P1DC62_bit          _BIT_ACCESS(PSTR1CON,6)
// PSTR1CON<P1DC6CON>
extern volatile __bit                   P1DC6CON            __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 P1DC6CON_bit        _BIT_ACCESS(PSTR1CON,6)
// CCP1CON<P1M0>
extern volatile __bit                   P1M0                __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 P1M0_bit            _BIT_ACCESS(CCP1CON,6)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x7DCF);	// @ (0xFB9 * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// ECCP1DEL<P1RSEN>
extern volatile __bit                   P1RSEN              __at(0x7DE7);	// @ (0xFBC * 8 + 7)
#define                                 P1RSEN_bit          _BIT_ACCESS(ECCP1DEL,7)
// ECCP2DEL<P2DC0>
extern volatile __bit                   P2DC0               __at(0x7A88);	// @ (0xF51 * 8 + 0)
#define                                 P2DC0_bit           _BIT_ACCESS(ECCP2DEL,0)
// PSTR2CON<P2DC02>
extern volatile __bit                   P2DC02              __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 P2DC02_bit          _BIT_ACCESS(PSTR2CON,0)
// PSTR2CON<P2DC0CON>
extern volatile __bit                   P2DC0CON            __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 P2DC0CON_bit        _BIT_ACCESS(PSTR2CON,0)
// ECCP2DEL<P2DC1>
extern volatile __bit                   P2DC1               __at(0x7A89);	// @ (0xF51 * 8 + 1)
#define                                 P2DC1_bit           _BIT_ACCESS(ECCP2DEL,1)
// PSTR2CON<P2DC12>
extern volatile __bit                   P2DC12              __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 P2DC12_bit          _BIT_ACCESS(PSTR2CON,1)
// PSTR2CON<P2DC1CON>
extern volatile __bit                   P2DC1CON            __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 P2DC1CON_bit        _BIT_ACCESS(PSTR2CON,1)
// ECCP2DEL<P2DC2>
extern volatile __bit                   P2DC2               __at(0x7A8A);	// @ (0xF51 * 8 + 2)
#define                                 P2DC2_bit           _BIT_ACCESS(ECCP2DEL,2)
// PSTR2CON<P2DC22>
extern volatile __bit                   P2DC22              __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 P2DC22_bit          _BIT_ACCESS(PSTR2CON,2)
// PSTR2CON<P2DC2CON>
extern volatile __bit                   P2DC2CON            __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 P2DC2CON_bit        _BIT_ACCESS(PSTR2CON,2)
// ECCP2DEL<P2DC3>
extern volatile __bit                   P2DC3               __at(0x7A8B);	// @ (0xF51 * 8 + 3)
#define                                 P2DC3_bit           _BIT_ACCESS(ECCP2DEL,3)
// PSTR2CON<P2DC32>
extern volatile __bit                   P2DC32              __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 P2DC32_bit          _BIT_ACCESS(PSTR2CON,3)
// PSTR2CON<P2DC3CON>
extern volatile __bit                   P2DC3CON            __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 P2DC3CON_bit        _BIT_ACCESS(PSTR2CON,3)
// ECCP2DEL<P2DC4>
extern volatile __bit                   P2DC4               __at(0x7A8C);	// @ (0xF51 * 8 + 4)
#define                                 P2DC4_bit           _BIT_ACCESS(ECCP2DEL,4)
// PSTR2CON<P2DC42>
extern volatile __bit                   P2DC42              __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 P2DC42_bit          _BIT_ACCESS(PSTR2CON,4)
// PSTR2CON<P2DC4CON>
extern volatile __bit                   P2DC4CON            __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 P2DC4CON_bit        _BIT_ACCESS(PSTR2CON,4)
// ECCP2DEL<P2DC5>
extern volatile __bit                   P2DC5               __at(0x7A8D);	// @ (0xF51 * 8 + 5)
#define                                 P2DC5_bit           _BIT_ACCESS(ECCP2DEL,5)
// ECCP2DEL<P2DC6>
extern volatile __bit                   P2DC6               __at(0x7A8E);	// @ (0xF51 * 8 + 6)
#define                                 P2DC6_bit           _BIT_ACCESS(ECCP2DEL,6)
// PSTR2CON<P2DC62>
extern volatile __bit                   P2DC62              __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 P2DC62_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR2CON<P2DC6CON>
extern volatile __bit                   P2DC6CON            __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 P2DC6CON_bit        _BIT_ACCESS(PSTR2CON,6)
// CCP2CON<P2M0>
extern volatile __bit                   P2M0                __at(0x7A76);	// @ (0xF4E * 8 + 6)
