MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J94/mcu.h
extern volatile __bit                   S44C1               __at(0x74DC);	// @ (0xE9B * 8 + 4)
#define                                 S44C1_bit           _BIT_ACCESS(LCDDATA13,4)
// LCDDATA21<S44C2>
extern volatile __bit                   S44C2               __at(0x751C);	// @ (0xEA3 * 8 + 4)
#define                                 S44C2_bit           _BIT_ACCESS(LCDDATA21,4)
// LCDDATA29<S44C3>
extern volatile __bit                   S44C3               __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 S44C3_bit           _BIT_ACCESS(LCDDATA29,4)
// LCDDATA37<S44C4>
extern volatile __bit                   S44C4               __at(0x759C);	// @ (0xEB3 * 8 + 4)
#define                                 S44C4_bit           _BIT_ACCESS(LCDDATA37,4)
// LCDDATA45<S44C5>
extern volatile __bit                   S44C5               __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 S44C5_bit           _BIT_ACCESS(LCDDATA45,4)
// LCDDATA53<S44C6>
extern volatile __bit                   S44C6               __at(0x761C);	// @ (0xEC3 * 8 + 4)
#define                                 S44C6_bit           _BIT_ACCESS(LCDDATA53,4)
// LCDDATA61<S44C7>
extern volatile __bit                   S44C7               __at(0x765C);	// @ (0xECB * 8 + 4)
#define                                 S44C7_bit           _BIT_ACCESS(LCDDATA61,4)
// LCDDATA5<S45C0>
extern volatile __bit                   S45C0               __at(0x749D);	// @ (0xE93 * 8 + 5)
#define                                 S45C0_bit           _BIT_ACCESS(LCDDATA5,5)
// LCDDATA13<S45C1>
extern volatile __bit                   S45C1               __at(0x74DD);	// @ (0xE9B * 8 + 5)
#define                                 S45C1_bit           _BIT_ACCESS(LCDDATA13,5)
// LCDDATA21<S45C2>
extern volatile __bit                   S45C2               __at(0x751D);	// @ (0xEA3 * 8 + 5)
#define                                 S45C2_bit           _BIT_ACCESS(LCDDATA21,5)
// LCDDATA29<S45C3>
extern volatile __bit                   S45C3               __at(0x755D);	// @ (0xEAB * 8 + 5)
#define                                 S45C3_bit           _BIT_ACCESS(LCDDATA29,5)
// LCDDATA37<S45C4>
extern volatile __bit                   S45C4               __at(0x759D);	// @ (0xEB3 * 8 + 5)
#define                                 S45C4_bit           _BIT_ACCESS(LCDDATA37,5)
// LCDDATA45<S45C5>
extern volatile __bit                   S45C5               __at(0x75DD);	// @ (0xEBB * 8 + 5)
#define                                 S45C5_bit           _BIT_ACCESS(LCDDATA45,5)
// LCDDATA53<S45C6>
extern volatile __bit                   S45C6               __at(0x761D);	// @ (0xEC3 * 8 + 5)
#define                                 S45C6_bit           _BIT_ACCESS(LCDDATA53,5)
// LCDDATA61<S45C7>
extern volatile __bit                   S45C7               __at(0x765D);	// @ (0xECB * 8 + 5)
#define                                 S45C7_bit           _BIT_ACCESS(LCDDATA61,5)
// LCDDATA5<S46C0>
extern volatile __bit                   S46C0               __at(0x749E);	// @ (0xE93 * 8 + 6)
#define                                 S46C0_bit           _BIT_ACCESS(LCDDATA5,6)
// LCDDATA13<S46C1>
extern volatile __bit                   S46C1               __at(0x74DE);	// @ (0xE9B * 8 + 6)
#define                                 S46C1_bit           _BIT_ACCESS(LCDDATA13,6)
// LCDDATA21<S46C2>
extern volatile __bit                   S46C2               __at(0x751E);	// @ (0xEA3 * 8 + 6)
#define                                 S46C2_bit           _BIT_ACCESS(LCDDATA21,6)
// LCDDATA29<S46C3>
extern volatile __bit                   S46C3               __at(0x755E);	// @ (0xEAB * 8 + 6)
#define                                 S46C3_bit           _BIT_ACCESS(LCDDATA29,6)
// LCDDATA37<S46C4>
extern volatile __bit                   S46C4               __at(0x759E);	// @ (0xEB3 * 8 + 6)
#define                                 S46C4_bit           _BIT_ACCESS(LCDDATA37,6)
// LCDDATA45<S46C5>
extern volatile __bit                   S46C5               __at(0x75DE);	// @ (0xEBB * 8 + 6)
#define                                 S46C5_bit           _BIT_ACCESS(LCDDATA45,6)
// LCDDATA53<S46C6>
extern volatile __bit                   S46C6               __at(0x761E);	// @ (0xEC3 * 8 + 6)
#define                                 S46C6_bit           _BIT_ACCESS(LCDDATA53,6)
// LCDDATA61<S46C7>
extern volatile __bit                   S46C7               __at(0x765E);	// @ (0xECB * 8 + 6)
#define                                 S46C7_bit           _BIT_ACCESS(LCDDATA61,6)
// LCDDATA5<S47C0>
extern volatile __bit                   S47C0               __at(0x749F);	// @ (0xE93 * 8 + 7)
#define                                 S47C0_bit           _BIT_ACCESS(LCDDATA5,7)
// LCDDATA13<S47C1>
extern volatile __bit                   S47C1               __at(0x74DF);	// @ (0xE9B * 8 + 7)
#define                                 S47C1_bit           _BIT_ACCESS(LCDDATA13,7)
// LCDDATA21<S47C2>
extern volatile __bit                   S47C2               __at(0x751F);	// @ (0xEA3 * 8 + 7)
#define                                 S47C2_bit           _BIT_ACCESS(LCDDATA21,7)
// LCDDATA29<S47C3>
extern volatile __bit                   S47C3               __at(0x755F);	// @ (0xEAB * 8 + 7)
#define                                 S47C3_bit           _BIT_ACCESS(LCDDATA29,7)
// LCDDATA37<S47C4>
extern volatile __bit                   S47C4               __at(0x759F);	// @ (0xEB3 * 8 + 7)
#define                                 S47C4_bit           _BIT_ACCESS(LCDDATA37,7)
// LCDDATA45<S47C5>
extern volatile __bit                   S47C5               __at(0x75DF);	// @ (0xEBB * 8 + 7)
#define                                 S47C5_bit           _BIT_ACCESS(LCDDATA45,7)
// LCDDATA53<S47C6>
extern volatile __bit                   S47C6               __at(0x761F);	// @ (0xEC3 * 8 + 7)
#define                                 S47C6_bit           _BIT_ACCESS(LCDDATA53,7)
// LCDDATA61<S47C7>
extern volatile __bit                   S47C7               __at(0x765F);	// @ (0xECB * 8 + 7)
#define                                 S47C7_bit           _BIT_ACCESS(LCDDATA61,7)
// LCDDATA6<S48C0>
extern volatile __bit                   S48C0               __at(0x74A0);	// @ (0xE94 * 8 + 0)
#define                                 S48C0_bit           _BIT_ACCESS(LCDDATA6,0)
// LCDDATA14<S48C1>
extern volatile __bit                   S48C1               __at(0x74E0);	// @ (0xE9C * 8 + 0)
#define                                 S48C1_bit           _BIT_ACCESS(LCDDATA14,0)
// LCDDATA22<S48C2>
extern volatile __bit                   S48C2               __at(0x7520);	// @ (0xEA4 * 8 + 0)
#define                                 S48C2_bit           _BIT_ACCESS(LCDDATA22,0)
// LCDDATA30<S48C3>
extern volatile __bit                   S48C3               __at(0x7560);	// @ (0xEAC * 8 + 0)
#define                                 S48C3_bit           _BIT_ACCESS(LCDDATA30,0)
// LCDDATA38<S48C4>
extern volatile __bit                   S48C4               __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 S48C4_bit           _BIT_ACCESS(LCDDATA38,0)
// LCDDATA46<S48C5>
extern volatile __bit                   S48C5               __at(0x75E0);	// @ (0xEBC * 8 + 0)
#define                                 S48C5_bit           _BIT_ACCESS(LCDDATA46,0)
// LCDDATA54<S48C6>
extern volatile __bit                   S48C6               __at(0x7620);	// @ (0xEC4 * 8 + 0)
#define                                 S48C6_bit           _BIT_ACCESS(LCDDATA54,0)
// LCDDATA62<S48C7>
extern volatile __bit                   S48C7               __at(0x7660);	// @ (0xECC * 8 + 0)
#define                                 S48C7_bit           _BIT_ACCESS(LCDDATA62,0)
// LCDDATA6<S49C0>
extern volatile __bit                   S49C0               __at(0x74A1);	// @ (0xE94 * 8 + 1)
#define                                 S49C0_bit           _BIT_ACCESS(LCDDATA6,1)
// LCDDATA14<S49C1>
extern volatile __bit                   S49C1               __at(0x74E1);	// @ (0xE9C * 8 + 1)
#define                                 S49C1_bit           _BIT_ACCESS(LCDDATA14,1)
// LCDDATA22<S49C2>
extern volatile __bit                   S49C2               __at(0x7521);	// @ (0xEA4 * 8 + 1)
#define                                 S49C2_bit           _BIT_ACCESS(LCDDATA22,1)
// LCDDATA30<S49C3>
extern volatile __bit                   S49C3               __at(0x7561);	// @ (0xEAC * 8 + 1)
#define                                 S49C3_bit           _BIT_ACCESS(LCDDATA30,1)
// LCDDATA38<S49C4>
extern volatile __bit                   S49C4               __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 S49C4_bit           _BIT_ACCESS(LCDDATA38,1)
// LCDDATA46<S49C5>
extern volatile __bit                   S49C5               __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 S49C5_bit           _BIT_ACCESS(LCDDATA46,1)
// LCDDATA54<S49C6>
extern volatile __bit                   S49C6               __at(0x7621);	// @ (0xEC4 * 8 + 1)
#define                                 S49C6_bit           _BIT_ACCESS(LCDDATA54,1)
// LCDDATA62<S49C7>
extern volatile __bit                   S49C7               __at(0x7661);	// @ (0xECC * 8 + 1)
#define                                 S49C7_bit           _BIT_ACCESS(LCDDATA62,1)
// LCDDATA6<S50C0>
extern volatile __bit                   S50C0               __at(0x74A2);	// @ (0xE94 * 8 + 2)
#define                                 S50C0_bit           _BIT_ACCESS(LCDDATA6,2)
// LCDDATA14<S50C1>
extern volatile __bit                   S50C1               __at(0x74E2);	// @ (0xE9C * 8 + 2)
#define                                 S50C1_bit           _BIT_ACCESS(LCDDATA14,2)
// LCDDATA22<S50C2>
extern volatile __bit                   S50C2               __at(0x7522);	// @ (0xEA4 * 8 + 2)
#define                                 S50C2_bit           _BIT_ACCESS(LCDDATA22,2)
// LCDDATA30<S50C3>
extern volatile __bit                   S50C3               __at(0x7562);	// @ (0xEAC * 8 + 2)
#define                                 S50C3_bit           _BIT_ACCESS(LCDDATA30,2)
// LCDDATA38<S50C4>
extern volatile __bit                   S50C4               __at(0x75A2);	// @ (0xEB4 * 8 + 2)
#define                                 S50C4_bit           _BIT_ACCESS(LCDDATA38,2)
// LCDDATA46<S50C5>
extern volatile __bit                   S50C5               __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 S50C5_bit           _BIT_ACCESS(LCDDATA46,2)
// LCDDATA54<S50C6>
extern volatile __bit                   S50C6               __at(0x7622);	// @ (0xEC4 * 8 + 2)
#define                                 S50C6_bit           _BIT_ACCESS(LCDDATA54,2)
// LCDDATA62<S50C7>
extern volatile __bit                   S50C7               __at(0x7662);	// @ (0xECC * 8 + 2)
#define                                 S50C7_bit           _BIT_ACCESS(LCDDATA62,2)
// LCDDATA6<S51C0>
extern volatile __bit                   S51C0               __at(0x74A3);	// @ (0xE94 * 8 + 3)
#define                                 S51C0_bit           _BIT_ACCESS(LCDDATA6,3)
// LCDDATA14<S51C1>
extern volatile __bit                   S51C1               __at(0x74E3);	// @ (0xE9C * 8 + 3)
#define                                 S51C1_bit           _BIT_ACCESS(LCDDATA14,3)
// LCDDATA22<S51C2>
extern volatile __bit                   S51C2               __at(0x7523);	// @ (0xEA4 * 8 + 3)
#define                                 S51C2_bit           _BIT_ACCESS(LCDDATA22,3)
// LCDDATA30<S51C3>
extern volatile __bit                   S51C3               __at(0x7563);	// @ (0xEAC * 8 + 3)
#define                                 S51C3_bit           _BIT_ACCESS(LCDDATA30,3)
// LCDDATA38<S51C4>
extern volatile __bit                   S51C4               __at(0x75A3);	// @ (0xEB4 * 8 + 3)
#define                                 S51C4_bit           _BIT_ACCESS(LCDDATA38,3)
// LCDDATA46<S51C5>
extern volatile __bit                   S51C5               __at(0x75E3);	// @ (0xEBC * 8 + 3)
#define                                 S51C5_bit           _BIT_ACCESS(LCDDATA46,3)
// LCDDATA54<S51C6>
extern volatile __bit                   S51C6               __at(0x7623);	// @ (0xEC4 * 8 + 3)
#define                                 S51C6_bit           _BIT_ACCESS(LCDDATA54,3)
// LCDDATA62<S51C7>
extern volatile __bit                   S51C7               __at(0x7663);	// @ (0xECC * 8 + 3)
#define                                 S51C7_bit           _BIT_ACCESS(LCDDATA62,3)
// LCDDATA6<S52C0>
extern volatile __bit                   S52C0               __at(0x74A4);	// @ (0xE94 * 8 + 4)
#define                                 S52C0_bit           _BIT_ACCESS(LCDDATA6,4)
// LCDDATA14<S52C1>
extern volatile __bit                   S52C1               __at(0x74E4);	// @ (0xE9C * 8 + 4)
#define                                 S52C1_bit           _BIT_ACCESS(LCDDATA14,4)
// LCDDATA22<S52C2>
extern volatile __bit                   S52C2               __at(0x7524);	// @ (0xEA4 * 8 + 4)
#define                                 S52C2_bit           _BIT_ACCESS(LCDDATA22,4)
// LCDDATA30<S52C3>
extern volatile __bit                   S52C3               __at(0x7564);	// @ (0xEAC * 8 + 4)
#define                                 S52C3_bit           _BIT_ACCESS(LCDDATA30,4)
// LCDDATA38<S52C4>
extern volatile __bit                   S52C4               __at(0x75A4);	// @ (0xEB4 * 8 + 4)
#define                                 S52C4_bit           _BIT_ACCESS(LCDDATA38,4)
// LCDDATA46<S52C5>
extern volatile __bit                   S52C5               __at(0x75E4);	// @ (0xEBC * 8 + 4)
#define                                 S52C5_bit           _BIT_ACCESS(LCDDATA46,4)
// LCDDATA54<S52C6>
extern volatile __bit                   S52C6               __at(0x7624);	// @ (0xEC4 * 8 + 4)
#define                                 S52C6_bit           _BIT_ACCESS(LCDDATA54,4)
// LCDDATA62<S52C7>
extern volatile __bit                   S52C7               __at(0x7664);	// @ (0xECC * 8 + 4)
#define                                 S52C7_bit           _BIT_ACCESS(LCDDATA62,4)
// LCDDATA6<S53C0>
extern volatile __bit                   S53C0               __at(0x74A5);	// @ (0xE94 * 8 + 5)
#define                                 S53C0_bit           _BIT_ACCESS(LCDDATA6,5)
// LCDDATA14<S53C1>
extern volatile __bit                   S53C1               __at(0x74E5);	// @ (0xE9C * 8 + 5)
#define                                 S53C1_bit           _BIT_ACCESS(LCDDATA14,5)
// LCDDATA22<S53C2>
extern volatile __bit                   S53C2               __at(0x7525);	// @ (0xEA4 * 8 + 5)
#define                                 S53C2_bit           _BIT_ACCESS(LCDDATA22,5)
// LCDDATA30<S53C3>
extern volatile __bit                   S53C3               __at(0x7565);	// @ (0xEAC * 8 + 5)
#define                                 S53C3_bit           _BIT_ACCESS(LCDDATA30,5)
// LCDDATA38<S53C4>
extern volatile __bit                   S53C4               __at(0x75A5);	// @ (0xEB4 * 8 + 5)
#define                                 S53C4_bit           _BIT_ACCESS(LCDDATA38,5)
// LCDDATA46<S53C5>
extern volatile __bit                   S53C5               __at(0x75E5);	// @ (0xEBC * 8 + 5)
#define                                 S53C5_bit           _BIT_ACCESS(LCDDATA46,5)
// LCDDATA54<S53C6>
extern volatile __bit                   S53C6               __at(0x7625);	// @ (0xEC4 * 8 + 5)
#define                                 S53C6_bit           _BIT_ACCESS(LCDDATA54,5)
// LCDDATA62<S53C7>
extern volatile __bit                   S53C7               __at(0x7665);	// @ (0xECC * 8 + 5)
#define                                 S53C7_bit           _BIT_ACCESS(LCDDATA62,5)
// LCDDATA6<S54C0>
extern volatile __bit                   S54C0               __at(0x74A6);	// @ (0xE94 * 8 + 6)
#define                                 S54C0_bit           _BIT_ACCESS(LCDDATA6,6)
// LCDDATA14<S54C1>
extern volatile __bit                   S54C1               __at(0x74E6);	// @ (0xE9C * 8 + 6)
#define                                 S54C1_bit           _BIT_ACCESS(LCDDATA14,6)
// LCDDATA22<S54C2>
extern volatile __bit                   S54C2               __at(0x7526);	// @ (0xEA4 * 8 + 6)
#define                                 S54C2_bit           _BIT_ACCESS(LCDDATA22,6)
// LCDDATA30<S54C3>
extern volatile __bit                   S54C3               __at(0x7566);	// @ (0xEAC * 8 + 6)
#define                                 S54C3_bit           _BIT_ACCESS(LCDDATA30,6)
// LCDDATA38<S54C4>
extern volatile __bit                   S54C4               __at(0x75A6);	// @ (0xEB4 * 8 + 6)
#define                                 S54C4_bit           _BIT_ACCESS(LCDDATA38,6)
// LCDDATA46<S54C5>
extern volatile __bit                   S54C5               __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 S54C5_bit           _BIT_ACCESS(LCDDATA46,6)
// LCDDATA54<S54C6>
extern volatile __bit                   S54C6               __at(0x7626);	// @ (0xEC4 * 8 + 6)
#define                                 S54C6_bit           _BIT_ACCESS(LCDDATA54,6)
// LCDDATA62<S54C7>
extern volatile __bit                   S54C7               __at(0x7666);	// @ (0xECC * 8 + 6)
#define                                 S54C7_bit           _BIT_ACCESS(LCDDATA62,6)
// LCDDATA6<S55C0>
extern volatile __bit                   S55C0               __at(0x74A7);	// @ (0xE94 * 8 + 7)
#define                                 S55C0_bit           _BIT_ACCESS(LCDDATA6,7)
// LCDDATA14<S55C1>
extern volatile __bit                   S55C1               __at(0x74E7);	// @ (0xE9C * 8 + 7)
#define                                 S55C1_bit           _BIT_ACCESS(LCDDATA14,7)
// LCDDATA22<S55C2>
extern volatile __bit                   S55C2               __at(0x7527);	// @ (0xEA4 * 8 + 7)
#define                                 S55C2_bit           _BIT_ACCESS(LCDDATA22,7)
// LCDDATA30<S55C3>
extern volatile __bit                   S55C3               __at(0x7567);	// @ (0xEAC * 8 + 7)
#define                                 S55C3_bit           _BIT_ACCESS(LCDDATA30,7)
// LCDDATA38<S55C4>
extern volatile __bit                   S55C4               __at(0x75A7);	// @ (0xEB4 * 8 + 7)
#define                                 S55C4_bit           _BIT_ACCESS(LCDDATA38,7)
// LCDDATA46<S55C5>
extern volatile __bit                   S55C5               __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 S55C5_bit           _BIT_ACCESS(LCDDATA46,7)
// LCDDATA54<S55C6>
extern volatile __bit                   S55C6               __at(0x7627);	// @ (0xEC4 * 8 + 7)
#define                                 S55C6_bit           _BIT_ACCESS(LCDDATA54,7)
// LCDDATA62<S55C7>
extern volatile __bit                   S55C7               __at(0x7667);	// @ (0xECC * 8 + 7)
#define                                 S55C7_bit           _BIT_ACCESS(LCDDATA62,7)
// LCDDATA7<S56C0>
extern volatile __bit                   S56C0               __at(0x74A8);	// @ (0xE95 * 8 + 0)
#define                                 S56C0_bit           _BIT_ACCESS(LCDDATA7,0)
// LCDDATA15<S56C1>
extern volatile __bit                   S56C1               __at(0x74E8);	// @ (0xE9D * 8 + 0)
#define                                 S56C1_bit           _BIT_ACCESS(LCDDATA15,0)
// LCDDATA23<S56C2>
extern volatile __bit                   S56C2               __at(0x7528);	// @ (0xEA5 * 8 + 0)
#define                                 S56C2_bit           _BIT_ACCESS(LCDDATA23,0)
// LCDDATA31<S56C3>
extern volatile __bit                   S56C3               __at(0x7568);	// @ (0xEAD * 8 + 0)
#define                                 S56C3_bit           _BIT_ACCESS(LCDDATA31,0)
// LCDDATA39<S56C4>
extern volatile __bit                   S56C4               __at(0x75A8);	// @ (0xEB5 * 8 + 0)
#define                                 S56C4_bit           _BIT_ACCESS(LCDDATA39,0)
// LCDDATA47<S56C5>
extern volatile __bit                   S56C5               __at(0x75E8);	// @ (0xEBD * 8 + 0)
#define                                 S56C5_bit           _BIT_ACCESS(LCDDATA47,0)
// LCDDATA55<S56C6>
extern volatile __bit                   S56C6               __at(0x7628);	// @ (0xEC5 * 8 + 0)
#define                                 S56C6_bit           _BIT_ACCESS(LCDDATA55,0)
// LCDDATA63<S56C7>
extern volatile __bit                   S56C7               __at(0x7668);	// @ (0xECD * 8 + 0)
#define                                 S56C7_bit           _BIT_ACCESS(LCDDATA63,0)
// LCDDATA7<S57C0>
extern volatile __bit                   S57C0               __at(0x74A9);	// @ (0xE95 * 8 + 1)
#define                                 S57C0_bit           _BIT_ACCESS(LCDDATA7,1)
// LCDDATA15<S57C1>
extern volatile __bit                   S57C1               __at(0x74E9);	// @ (0xE9D * 8 + 1)
#define                                 S57C1_bit           _BIT_ACCESS(LCDDATA15,1)
// LCDDATA23<S57C2>
extern volatile __bit                   S57C2               __at(0x7529);	// @ (0xEA5 * 8 + 1)
#define                                 S57C2_bit           _BIT_ACCESS(LCDDATA23,1)
// LCDDATA31<S57C3>
extern volatile __bit                   S57C3               __at(0x7569);	// @ (0xEAD * 8 + 1)
#define                                 S57C3_bit           _BIT_ACCESS(LCDDATA31,1)
// LCDDATA39<S57C4>
extern volatile __bit                   S57C4               __at(0x75A9);	// @ (0xEB5 * 8 + 1)
#define                                 S57C4_bit           _BIT_ACCESS(LCDDATA39,1)
// LCDDATA47<S57C5>
extern volatile __bit                   S57C5               __at(0x75E9);	// @ (0xEBD * 8 + 1)
#define                                 S57C5_bit           _BIT_ACCESS(LCDDATA47,1)
// LCDDATA55<S57C6>
extern volatile __bit                   S57C6               __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 S57C6_bit           _BIT_ACCESS(LCDDATA55,1)
// LCDDATA63<S57C7>
extern volatile __bit                   S57C7               __at(0x7669);	// @ (0xECD * 8 + 1)
#define                                 S57C7_bit           _BIT_ACCESS(LCDDATA63,1)
// LCDDATA7<S58C0>
extern volatile __bit                   S58C0               __at(0x74AA);	// @ (0xE95 * 8 + 2)
#define                                 S58C0_bit           _BIT_ACCESS(LCDDATA7,2)
// LCDDATA15<S58C1>
extern volatile __bit                   S58C1               __at(0x74EA);	// @ (0xE9D * 8 + 2)
#define                                 S58C1_bit           _BIT_ACCESS(LCDDATA15,2)
// LCDDATA23<S58C2>
extern volatile __bit                   S58C2               __at(0x752A);	// @ (0xEA5 * 8 + 2)
#define                                 S58C2_bit           _BIT_ACCESS(LCDDATA23,2)
// LCDDATA31<S58C3>
extern volatile __bit                   S58C3               __at(0x756A);	// @ (0xEAD * 8 + 2)
#define                                 S58C3_bit           _BIT_ACCESS(LCDDATA31,2)
// LCDDATA39<S58C4>
extern volatile __bit                   S58C4               __at(0x75AA);	// @ (0xEB5 * 8 + 2)
#define                                 S58C4_bit           _BIT_ACCESS(LCDDATA39,2)
// LCDDATA47<S58C5>
extern volatile __bit                   S58C5               __at(0x75EA);	// @ (0xEBD * 8 + 2)
#define                                 S58C5_bit           _BIT_ACCESS(LCDDATA47,2)
// LCDDATA55<S58C6>
extern volatile __bit                   S58C6               __at(0x762A);	// @ (0xEC5 * 8 + 2)
#define                                 S58C6_bit           _BIT_ACCESS(LCDDATA55,2)
// LCDDATA63<S58C7>
extern volatile __bit                   S58C7               __at(0x766A);	// @ (0xECD * 8 + 2)
#define                                 S58C7_bit           _BIT_ACCESS(LCDDATA63,2)
// LCDDATA7<S59C0>
extern volatile __bit                   S59C0               __at(0x74AB);	// @ (0xE95 * 8 + 3)
#define                                 S59C0_bit           _BIT_ACCESS(LCDDATA7,3)
// LCDDATA15<S59C1>
