MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J94/mcu.h
extern volatile __bit                   SE54                __at(0x76A6);	// @ (0xED4 * 8 + 6)
#define                                 SE54_bit            _BIT_ACCESS(LCDSE6,6)
// LCDSE6<SE55>
extern volatile __bit                   SE55                __at(0x76A7);	// @ (0xED4 * 8 + 7)
#define                                 SE55_bit            _BIT_ACCESS(LCDSE6,7)
// LCDSE7<SE56>
extern volatile __bit                   SE56                __at(0x76A8);	// @ (0xED5 * 8 + 0)
#define                                 SE56_bit            _BIT_ACCESS(LCDSE7,0)
// LCDSE7<SE57>
extern volatile __bit                   SE57                __at(0x76A9);	// @ (0xED5 * 8 + 1)
#define                                 SE57_bit            _BIT_ACCESS(LCDSE7,1)
// LCDSE7<SE58>
extern volatile __bit                   SE58                __at(0x76AA);	// @ (0xED5 * 8 + 2)
#define                                 SE58_bit            _BIT_ACCESS(LCDSE7,2)
// LCDSE7<SE59>
extern volatile __bit                   SE59                __at(0x76AB);	// @ (0xED5 * 8 + 3)
#define                                 SE59_bit            _BIT_ACCESS(LCDSE7,3)
// LCDSE7<SE60>
extern volatile __bit                   SE60                __at(0x76AC);	// @ (0xED5 * 8 + 4)
#define                                 SE60_bit            _BIT_ACCESS(LCDSE7,4)
// LCDSE7<SE61>
extern volatile __bit                   SE61                __at(0x76AD);	// @ (0xED5 * 8 + 5)
#define                                 SE61_bit            _BIT_ACCESS(LCDSE7,5)
// LCDSE7<SE62>
extern volatile __bit                   SE62                __at(0x76AE);	// @ (0xED5 * 8 + 6)
#define                                 SE62_bit            _BIT_ACCESS(LCDSE7,6)
// LCDSE7<SE63>
extern volatile __bit                   SE63                __at(0x76AF);	// @ (0xED5 * 8 + 7)
#define                                 SE63_bit            _BIT_ACCESS(LCDSE7,7)
// SSP1CON2<SEN1>
extern volatile __bit                   SEN1                __at(0x7E28);	// @ (0xFC5 * 8 + 0)
#define                                 SEN1_bit            _BIT_ACCESS(SSP1CON2,0)
// SSP2CON2<SEN2>
extern volatile __bit                   SEN2                __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 SEN2_bit            _BIT_ACCESS(SSP2CON2,0)
// TXSTA1<SENDB1>
extern volatile __bit                   SENDB1              __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB1_bit          _BIT_ACCESS(TXSTA1,3)
// LCDCON<SLPEN>
extern volatile __bit                   SLPEN               __at(0x76CE);	// @ (0xED9 * 8 + 6)
#define                                 SLPEN_bit           _BIT_ACCESS(LCDCON,6)
// SSP1STAT<SMP1>
extern volatile __bit                   SMP1                __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 SMP1_bit            _BIT_ACCESS(SSP1STAT,7)
// SSP2STAT<SMP2>
extern volatile __bit                   SMP2                __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 SMP2_bit            _BIT_ACCESS(SSP2STAT,7)
// ADCON2L<SMPI0>
extern volatile __bit                   SMPI0               __at(0x7462);	// @ (0xE8C * 8 + 2)
#define                                 SMPI0_bit           _BIT_ACCESS(ADCON2L,2)
// ADCON2L<SMPI1>
extern volatile __bit                   SMPI1               __at(0x7463);	// @ (0xE8C * 8 + 3)
#define                                 SMPI1_bit           _BIT_ACCESS(ADCON2L,3)
// ADCON2L<SMPI2>
extern volatile __bit                   SMPI2               __at(0x7464);	// @ (0xE8C * 8 + 4)
#define                                 SMPI2_bit           _BIT_ACCESS(ADCON2L,4)
// ADCON2L<SMPI3>
extern volatile __bit                   SMPI3               __at(0x7465);	// @ (0xE8C * 8 + 5)
#define                                 SMPI3_bit           _BIT_ACCESS(ADCON2L,5)
// ADCON2L<SMPI4>
extern volatile __bit                   SMPI4               __at(0x7466);	// @ (0xE8C * 8 + 6)
#define                                 SMPI4_bit           _BIT_ACCESS(ADCON2L,6)
// UIE<SOFIE>
extern volatile __bit                   SOFIE               __at(0x7086);	// @ (0xE10 * 8 + 6)
#define                                 SOFIE_bit           _BIT_ACCESS(UIE,6)
// UIR<SOFIF>
extern volatile __bit                   SOFIF               __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 SOFIF_bit           _BIT_ACCESS(UIR,6)
// T1CON<SOSCEN1>
extern volatile __bit                   SOSCEN1             __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 SOSCEN1_bit         _BIT_ACCESS(T1CON,3)
// T3CON<SOSCEN3>
extern volatile __bit                   SOSCEN3             __at(0x7D8B);	// @ (0xFB1 * 8 + 3)
#define                                 SOSCEN3_bit         _BIT_ACCESS(T3CON,3)
// T5CON<SOSCEN5>
extern volatile __bit                   SOSCEN5             __at(0x78A3);	// @ (0xF14 * 8 + 3)
#define                                 SOSCEN5_bit         _BIT_ACCESS(T5CON,3)
// OSCCON2<SOSCGO>
extern volatile __bit                   SOSCGO              __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 SOSCGO_bit          _BIT_ACCESS(OSCCON2,1)
// STKPTR<SP0>
extern volatile __bit                   SP0                 __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 SP0_bit             _BIT_ACCESS(STKPTR,0)
// STKPTR<SP1>
extern volatile __bit                   SP1                 __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 SP1_bit             _BIT_ACCESS(STKPTR,1)
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// PMD0<SPI1MD>
extern volatile __bit                   SPI1MD              __at(0x77A1);	// @ (0xEF4 * 8 + 1)
#define                                 SPI1MD_bit          _BIT_ACCESS(PMD0,1)
// PMD0<SPI2MD>
extern volatile __bit                   SPI2MD              __at(0x77A2);	// @ (0xEF4 * 8 + 2)
#define                                 SPI2MD_bit          _BIT_ACCESS(PMD0,2)
// RCSTA1<SRENA>
extern volatile __bit                   SRENA               __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SRENA_bit           _BIT_ACCESS(RCSTA1,5)
// RCON4<SRETEN>
extern volatile __bit                   SRETEN              __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 SRETEN_bit          _BIT_ACCESS(RCON4,4)
// RPINR10_11<SS1R0>
extern volatile __bit                   SS1R0               __at(0x7178);	// @ (0xE2F * 8 + 0)
#define                                 SS1R0_bit           _BIT_ACCESS(RPINR10_11,0)
// RPINR10_11<SS1R1>
extern volatile __bit                   SS1R1               __at(0x7179);	// @ (0xE2F * 8 + 1)
#define                                 SS1R1_bit           _BIT_ACCESS(RPINR10_11,1)
// RPINR10_11<SS1R2>
extern volatile __bit                   SS1R2               __at(0x717A);	// @ (0xE2F * 8 + 2)
#define                                 SS1R2_bit           _BIT_ACCESS(RPINR10_11,2)
// RPINR10_11<SS1R3>
extern volatile __bit                   SS1R3               __at(0x717B);	// @ (0xE2F * 8 + 3)
#define                                 SS1R3_bit           _BIT_ACCESS(RPINR10_11,3)
// PORTD<SS2>
extern volatile __bit                   SS2                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SS2_bit             _BIT_ACCESS(PORTD,7)
// RPINR12_13<SS2R0>
extern volatile __bit                   SS2R0               __at(0x7184);	// @ (0xE30 * 8 + 4)
#define                                 SS2R0_bit           _BIT_ACCESS(RPINR12_13,4)
// RPINR12_13<SS2R1>
extern volatile __bit                   SS2R1               __at(0x7185);	// @ (0xE30 * 8 + 5)
#define                                 SS2R1_bit           _BIT_ACCESS(RPINR12_13,5)
// RPINR12_13<SS2R2>
extern volatile __bit                   SS2R2               __at(0x7186);	// @ (0xE30 * 8 + 6)
#define                                 SS2R2_bit           _BIT_ACCESS(RPINR12_13,6)
// RPINR12_13<SS2R3>
extern volatile __bit                   SS2R3               __at(0x7187);	// @ (0xE30 * 8 + 7)
#define                                 SS2R3_bit           _BIT_ACCESS(RPINR12_13,7)
// DMACON1<SSCON0>
extern volatile __bit                   SSCON0              __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 SSCON0_bit          _BIT_ACCESS(DMACON1,6)
// DMACON1<SSCON1>
extern volatile __bit                   SSCON1              __at(0x7B07);	// @ (0xF60 * 8 + 7)
#define                                 SSCON1_bit          _BIT_ACCESS(DMACON1,7)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// IPR1<SSP1IP>
extern volatile __bit                   SSP1IP              __at(0x7CFB);	// @ (0xF9F * 8 + 3)
#define                                 SSP1IP_bit          _BIT_ACCESS(IPR1,3)
// PMD1<SSP1MD>
extern volatile __bit                   SSP1MD              __at(0x7798);	// @ (0xEF3 * 8 + 0)
#define                                 SSP1MD_bit          _BIT_ACCESS(PMD1,0)
// ODCON1<SSP1OD>
extern volatile __bit                   SSP1OD              __at(0x7758);	// @ (0xEEB * 8 + 0)
#define                                 SSP1OD_bit          _BIT_ACCESS(ODCON1,0)
// PIE2<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE2,6)
// PIR2<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR2,6)
// IPR2<SSP2IP>
extern volatile __bit                   SSP2IP              __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 SSP2IP_bit          _BIT_ACCESS(IPR2,6)
// PMD1<SSP2MD>
extern volatile __bit                   SSP2MD              __at(0x7799);	// @ (0xEF3 * 8 + 1)
#define                                 SSP2MD_bit          _BIT_ACCESS(PMD1,1)
// ODCON1<SSP2OD>
extern volatile __bit                   SSP2OD              __at(0x7759);	// @ (0xEEB * 8 + 1)
#define                                 SSP2OD_bit          _BIT_ACCESS(ODCON1,1)
// SSP1CON1<SSPEN1>
extern volatile __bit                   SSPEN1              __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 SSPEN1_bit          _BIT_ACCESS(SSP1CON1,5)
// SSP2CON1<SSPEN2>
extern volatile __bit                   SSPEN2              __at(0x78CD);	// @ (0xF19 * 8 + 5)
#define                                 SSPEN2_bit          _BIT_ACCESS(SSP2CON1,5)
// SSP1CON1<SSPM01>
extern volatile __bit                   SSPM01              __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 SSPM01_bit          _BIT_ACCESS(SSP1CON1,0)
// LCDDATA12<SSPM012>
extern volatile __bit                   SSPM012             __at(0x74D0);	// @ (0xE9A * 8 + 0)
#define                                 SSPM012_bit         _BIT_ACCESS(LCDDATA12,0)
// SSP2CON1<SSPM02>
extern volatile __bit                   SSPM02              __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 SSPM02_bit          _BIT_ACCESS(SSP2CON1,0)
// SSP1CON1<SSPM11>
extern volatile __bit                   SSPM11              __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 SSPM11_bit          _BIT_ACCESS(SSP1CON1,1)
// LCDDATA12<SSPM112>
extern volatile __bit                   SSPM112             __at(0x74D1);	// @ (0xE9A * 8 + 1)
#define                                 SSPM112_bit         _BIT_ACCESS(LCDDATA12,1)
// SSP2CON1<SSPM12>
extern volatile __bit                   SSPM12              __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 SSPM12_bit          _BIT_ACCESS(SSP2CON1,1)
// SSP1CON1<SSPM21>
extern volatile __bit                   SSPM21              __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 SSPM21_bit          _BIT_ACCESS(SSP1CON1,2)
// LCDDATA12<SSPM212>
extern volatile __bit                   SSPM212             __at(0x74D2);	// @ (0xE9A * 8 + 2)
#define                                 SSPM212_bit         _BIT_ACCESS(LCDDATA12,2)
// SSP2CON1<SSPM22>
extern volatile __bit                   SSPM22              __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 SSPM22_bit          _BIT_ACCESS(SSP2CON1,2)
// SSP1CON1<SSPM31>
extern volatile __bit                   SSPM31              __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 SSPM31_bit          _BIT_ACCESS(SSP1CON1,3)
// LCDDATA12<SSPM312>
extern volatile __bit                   SSPM312             __at(0x74D3);	// @ (0xE9A * 8 + 3)
#define                                 SSPM312_bit         _BIT_ACCESS(LCDDATA12,3)
// SSP2CON1<SSPM32>
extern volatile __bit                   SSPM32              __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 SSPM32_bit          _BIT_ACCESS(SSP2CON1,3)
// SSP1CON1<SSPOV1>
extern volatile __bit                   SSPOV1              __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP2CON1<SSPOV2>
extern volatile __bit                   SSPOV2              __at(0x78CE);	// @ (0xF19 * 8 + 6)
#define                                 SSPOV2_bit          _BIT_ACCESS(SSP2CON1,6)
// ADCON1L<SSRC0>
extern volatile __bit                   SSRC0               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 SSRC0_bit           _BIT_ACCESS(ADCON1L,4)
// ADCON1L<SSRC1>
extern volatile __bit                   SSRC1               __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 SSRC1_bit           _BIT_ACCESS(ADCON1L,5)
// ADCON1L<SSRC2>
extern volatile __bit                   SSRC2               __at(0x7E06);	// @ (0xFC0 * 8 + 6)
#define                                 SSRC2_bit           _BIT_ACCESS(ADCON1L,6)
// ADCON1L<SSRC3>
extern volatile __bit                   SSRC3               __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 SSRC3_bit           _BIT_ACCESS(ADCON1L,7)
// UIE<STALLIE>
extern volatile __bit                   STALLIE             __at(0x7085);	// @ (0xE10 * 8 + 5)
#define                                 STALLIE_bit         _BIT_ACCESS(UIE,5)
// UIR<STALLIF>
extern volatile __bit                   STALLIF             __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 STALLIF_bit         _BIT_ACCESS(UIR,5)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<START2>
extern volatile __bit                   START2              __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 START2_bit          _BIT_ACCESS(SSP2STAT,3)
// RCON3<STKERR>
extern volatile __bit                   STKERR              __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 STKERR_bit          _BIT_ACCESS(RCON3,7)
// STKPTR<STKFUL>
extern volatile __bit                   STKFUL              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKFUL_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKOVF>
extern volatile __bit                   STKOVF              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKUNF>
extern volatile __bit                   STKUNF              __at(0x7FE6);	// @ (0xFFC * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(STKPTR,6)
// SSP1STAT<STOP1>
extern volatile __bit                   STOP1               __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 STOP1_bit           _BIT_ACCESS(SSP1STAT,4)
// SSP2STAT<STOP2>
extern volatile __bit                   STOP2               __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 STOP2_bit           _BIT_ACCESS(SSP2STAT,4)
// PSTR1CON<STRA1>
extern volatile __bit                   STRA1               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 STRA1_bit           _BIT_ACCESS(PSTR1CON,0)
// PSTR2CON<STRA2>
extern volatile __bit                   STRA2               __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 STRA2_bit           _BIT_ACCESS(PSTR2CON,0)
// PSTR3CON<STRA3>
extern volatile __bit                   STRA3               __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 STRA3_bit           _BIT_ACCESS(PSTR3CON,0)
// PSTR1CON<STRB1>
extern volatile __bit                   STRB1               __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 STRB1_bit           _BIT_ACCESS(PSTR1CON,1)
// PSTR2CON<STRB2>
extern volatile __bit                   STRB2               __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 STRB2_bit           _BIT_ACCESS(PSTR2CON,1)
// PSTR3CON<STRB3>
extern volatile __bit                   STRB3               __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 STRB3_bit           _BIT_ACCESS(PSTR3CON,1)
// PSTR1CON<STRC1>
extern volatile __bit                   STRC1               __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 STRC1_bit           _BIT_ACCESS(PSTR1CON,2)
// PSTR2CON<STRC2>
extern volatile __bit                   STRC2               __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 STRC2_bit           _BIT_ACCESS(PSTR2CON,2)
// PSTR3CON<STRC3>
extern volatile __bit                   STRC3               __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 STRC3_bit           _BIT_ACCESS(PSTR3CON,2)
// PSTR1CON<STRD1>
extern volatile __bit                   STRD1               __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 STRD1_bit           _BIT_ACCESS(PSTR1CON,3)
// PSTR2CON<STRD2>
extern volatile __bit                   STRD2               __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 STRD2_bit           _BIT_ACCESS(PSTR2CON,3)
// PSTR3CON<STRD3>
extern volatile __bit                   STRD3               __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 STRD3_bit           _BIT_ACCESS(PSTR3CON,3)
// PSTR1CON<STRSYNC1>
extern volatile __bit                   STRSYNC1            __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 STRSYNC1_bit        _BIT_ACCESS(PSTR1CON,4)
// PSTR2CON<STRSYNC2>
extern volatile __bit                   STRSYNC2            __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 STRSYNC2_bit        _BIT_ACCESS(PSTR2CON,4)
// PSTR3CON<STRSYNC3>
extern volatile __bit                   STRSYNC3            __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 STRSYNC3_bit        _BIT_ACCESS(PSTR3CON,4)
// UCON<SUSPND>
extern volatile __bit                   SUSPND              __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 SUSPND_bit          _BIT_ACCESS(UCON,1)
// RCON2<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x7BED);	// @ (0xF7D * 8 + 5)
#define                                 SWDTEN_bit          _BIT_ACCESS(RCON2,5)
// TXSTA1<SYNC1>
extern volatile __bit                   SYNC1               __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 SYNC1_bit           _BIT_ACCESS(TXSTA1,4)
// T0CON<T08BIT>
extern volatile __bit                   T08BIT              __at(0x7EAE);	// @ (0xFD5 * 8 + 6)
#define                                 T08BIT_bit          _BIT_ACCESS(T0CON,6)
// RPINR38_39<T0CKIR0>
extern volatile __bit                   T0CKIR0             __at(0x71EC);	// @ (0xE3D * 8 + 4)
#define                                 T0CKIR0_bit         _BIT_ACCESS(RPINR38_39,4)
// RPINR38_39<T0CKIR1>
extern volatile __bit                   T0CKIR1             __at(0x71ED);	// @ (0xE3D * 8 + 5)
#define                                 T0CKIR1_bit         _BIT_ACCESS(RPINR38_39,5)
// RPINR38_39<T0CKIR2>
extern volatile __bit                   T0CKIR2             __at(0x71EE);	// @ (0xE3D * 8 + 6)
#define                                 T0CKIR2_bit         _BIT_ACCESS(RPINR38_39,6)
// RPINR38_39<T0CKIR3>
extern volatile __bit                   T0CKIR3             __at(0x71EF);	// @ (0xE3D * 8 + 7)
#define                                 T0CKIR3_bit         _BIT_ACCESS(RPINR38_39,7)
// T0CON<T0CS0>
extern volatile __bit                   T0CS0               __at(0x7EAC);	// @ (0xFD5 * 8 + 4)
#define                                 T0CS0_bit           _BIT_ACCESS(T0CON,4)
// T0CON<T0CS1>
extern volatile __bit                   T0CS1               __at(0x7EAD);	// @ (0xFD5 * 8 + 5)
#define                                 T0CS1_bit           _BIT_ACCESS(T0CON,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x7F95);	// @ (0xFF2 * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x7F92);	// @ (0xFF2 * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// INTCON2<T0IP>
extern volatile __bit                   T0IP                __at(0x7F8A);	// @ (0xFF1 * 8 + 2)
#define                                 T0IP_bit            _BIT_ACCESS(INTCON2,2)
// T0CON<T0PS0>
extern volatile __bit                   T0PS0               __at(0x7EA8);	// @ (0xFD5 * 8 + 0)
#define                                 T0PS0_bit           _BIT_ACCESS(T0CON,0)
// T0CON<T0PS1>
extern volatile __bit                   T0PS1               __at(0x7EA9);	// @ (0xFD5 * 8 + 1)
#define                                 T0PS1_bit           _BIT_ACCESS(T0CON,1)
// T0CON<T0PS2>
extern volatile __bit                   T0PS2               __at(0x7EAA);	// @ (0xFD5 * 8 + 2)
#define                                 T0PS2_bit           _BIT_ACCESS(T0CON,2)
// RPINR40_41<T1CKIR0>
extern volatile __bit                   T1CKIR0             __at(0x71F4);	// @ (0xE3E * 8 + 4)
#define                                 T1CKIR0_bit         _BIT_ACCESS(RPINR40_41,4)
// RPINR40_41<T1CKIR1>
extern volatile __bit                   T1CKIR1             __at(0x71F5);	// @ (0xE3E * 8 + 5)
#define                                 T1CKIR1_bit         _BIT_ACCESS(RPINR40_41,5)
// RPINR40_41<T1CKIR2>
extern volatile __bit                   T1CKIR2             __at(0x71F6);	// @ (0xE3E * 8 + 6)
#define                                 T1CKIR2_bit         _BIT_ACCESS(RPINR40_41,6)
// RPINR40_41<T1CKIR3>
extern volatile __bit                   T1CKIR3             __at(0x71F7);	// @ (0xE3E * 8 + 7)
#define                                 T1CKIR3_bit         _BIT_ACCESS(RPINR40_41,7)
// T1CON<T1CKPS0>
